progaurav052/MCU1_EMBEDDED_DRIVER_DEVELOPMENT/stm32f4xx_drivers/Src/002led_toggle_btn.c
/*
 * 002led_toggle_btn.c
 *
 *  Created on: Sep 28, 2025
 *      Author: LENOVO
 */

#include "stm32f407xx.h"
#define HIGH ENABLE
#define BTN_PRESSED HIGH
void delay(void){
	for(uint32_t i=0;i<500000;i++);

}
int main(){

	GPIO_Handle_t GpioLed,GpioBtn;
	GpioLed.pGPIOx=GPIOD;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber=GPIO_PIN_NO_13;
	GpioLed.GPIO_PinConfig.GPIO_PinMode=GPIO_MODE_OUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed=GPIO_SPEED_FAST;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType=GPIO_OP_TYPE_PP;
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl=GPIO_NO_PUPD;

	//first we have to enable peripheral clock for GPIO D
	GPIO_PeripheralClockControl(GPIOD, ENABLE);

	GPIO_Init(&GpioLed);

	GpioBtn.pGPIOx=GPIOA;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber=GPIO_PIN_NO_0;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode=GPIO_MODE_IN;
	GpioBtn.GPIO_PinConfig.GPIO_PinSpeed=GPIO_SPEED_FAST;
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl=GPIO_NO_PUPD;

	//first we have to enable peripheral clock for GPIO D
	GPIO_PeripheralClockControl(GPIOA, ENABLE);

	GPIO_Init(&GpioBtn);

	while(1){
		//toggle
		if(GPIO_ReadFromInputPin(GPIOA,GPIO_PIN_NO_0)== BTN_PRESSED)
		{

			GPIO_WriteToOutputPin(GPIOD,GPIO_PIN_NO_13,GPIO_PIN_SET);
		}
		else
		{
			GPIO_WriteToOutputPin(GPIOD,GPIO_PIN_NO_13,GPIO_PIN_RESET);
		}


	}

	return 0;

}
